let toLeft = document.querySelector('.arrow-left');
let toRight = document.querySelector('.arrow-right');
let slider = document.querySelector('.item-wrap');


// let sliderItem = document.querySelectorAll('.slider-item')


toLeft.addEventListener('click', function () {
    if (slider.scrollLeft <= 0) {
        slider.scrollLeft += slider.scrollWidth;
    }
    else {
        slider.scrollLeft -= 400;
    }

})



toRight.addEventListener('click', function () {
    let maxScrollRight = slider.scrollWidth - slider.clientWidth;
    if (slider.scrollLeft >= maxScrollRight - 1) {
        slider.scrollLeft -= slider.scrollWidth;
    }
    else {
        slider.scrollLeft += 400;
    }
})











let carsArray = [
 
    { 
        name: 'Лионе́ль Андре́с Ме́сси Куччитти́ни', 
        model: 'Аргентина , 24 июня 1987 | 34 года', 
        year: 'ПСЖ - Нападающий', 
        price: 'В составе «Барселоны» Месси обладатель десяти титулов чемпиона Испании, четырех титулов Лиги чемпионов УЕФА, шести Кубков Испании, восьми Суперкубков Испании, трех Суперкубков Европы и трех Кубков клубного чемпионата мира.', 
        color: '170 | 72', 
        image: 'about-Lionel_Messi_in_2018.jpg' , 
        about: "Лионе́ль Андре́с Ме́сси Куччитти́ни аргентинский футболист, нападающий клуба «Пари Сен-Жермен», капитан сборной Аргентины. Лучший бомбардир в истории чемпионата Испании, «Барселоны» и сборной Аргентины. Признаётся одним из лучших футболистов всех времён. Семикратный обладатель «Золотого мяча», шестикратный — «Золотой бутсы». Воспитанник академии «Барселоны», вместе с этим клубом выиграл десять титулов чемпиона Испании, четыре Лиги чемпионов УЕФА, семь Кубков Испании, восемь Суперкубков Испании, три Суперкубка Европы и три чемпионата мира среди клубов. Чемпион Франции в составе «Пари Сен-Жермен». В возрасте 13 лет вместе с родителями переехал в Испанию, чтобы присоединиться к молодёжной команде «Барселоны», в октябре 2004 года дебютировал за основной состав этого клубаПерейти к разделу «#Фарм-клубы и первые матчи в основной команде (2003—2005)»",
    },
    { 
        name: 'Луи́с Альбе́рто Суа́рес Ди́ас', 
        model: 'Уругвай ,  24 января 1987 | 35 лет ', 
        year: 'Атлетико - Нападающий ', 
        price: 'Суарес вызывался в состав молодёжной сборной Уругвая на ЧМ-2007 (до 20 лет). 8 февраля 2007 года дебютировал за первую сборную страны в матче против Колумбии (3:1). В 2010 году сыграл важную роль для «ла селесты», занявшей 4-е место на чемпионате мира, когда забил 3 гола на турнире, а также отразил руками мяч, летевший на последних минутах дополнительного времени в пустые ворота. За это он был удалён с поля в 1/4 финала против сборной Ганы. В 2011 году победил со сборной Уругвая на Кубке Америки, в рекордный для сборной 15-й раз. На турнире Суарес забил 4 гола и был признан лучшим игроком розыгрыша. 23 июня 2013 года, оформив дубль в ворота сборной Таити, Суарес вышел на первое место среди лучших бомбардиров в истории сборной Уругвая', 
        color: '182 | 86', 
        image: 'about_Luis_Suárez_Uruguay.jpg' , 
        about: 'Воспитанник «Насьоналя» из Монтевидео, в составе которого стал чемпионом Уругвая в 2006 году. В возрасте 19 лет перебрался в Голландию в команду Эредивизи — «Гронинген»Перейти к разделу «#«Гронинген»». В 2007 перешёл в амстердамский «Аякс». В сезоне 2008/09 был признан игроком года в команде. В следующем сезоне назначен капитаном, тогда он забил 35 голов в 33 матчах чемпионата и был признан футболистом года в Нидерландах. Всего во всех соревнованиях за «Аякс» в том сезоне он отличился 49 раз, а также победил с командой в Кубке Нидерландов. В сезоне 2010/11 он забил сотый гол за клуб, присоединившись тем самым к таким игрокам, как Деннис Бергкамп, Йохан Кройф и Марко ван Бастен, которые ранее также преодолели данный рубеж',
    },
    
    { 
        name: 'Нейма́р да Сі́лва Са́нтус Жуніо́р', 
        model: 'Бразилия , 5 февраля 1992 | 30 лет', 
        year: 'ПСЖ - Нападающий', 
        price: 'В составе этого клуба выиграл три чемпионских титула: Лиги Паулиста, Кубок Бразилии, Кубок Либертадорес, а также Рекопу Южной Америки. В 2011 и 2012 году признавался лучшим футболистом года в Южной Америке. В 2011 году был удостоен премии ФИФА имени Ференца Пушкаша за лучший гол года.', 
        color: '175  |68', 
        image: 'about-Neymar_PSG.jpg', 
        about: "2008 року футболіст підписав свій перший професійний контракт із «Сантосом», розрахований до 2014 року, з величезною сумою відступних, які відразу відлякали багатьох потенційних покупців, 40 % угоди належить компанії «Гропа Сонда», хоча деякі клуби не відступилися, зокрема «Манчестер Юнайтед» і «Реал», але іспанський клуб мав пріоритетне право на купівлю футболіста, оскільки підписав з ним попередній контракт. 7 березня 2009 року Неймар дебютував в основному складі «Сантоса» у матчі з «Оесте», замінивши Маурісіо Моліну. Через тиждень у матчі з «Можі-Мірін» форвард забив свій перший м'яч в основному складі клубу.",
    }, 
];

let application = {
    data() {
        return {
            array: carsArray,
            currentCar: carsArray[0],
            selectIndex: 0,
            priceShow: false,
        }
    },
    methods: {
        numberCar(index){
            this.selectIndex = index;
            this.currentCar = this.array[index]
        },
        showPrice(){
            this.priceShow == false ? this.priceShow = true : this.priceShow = false;
            console.log(this.priceShow);
        }
    },
}
Vue.createApp(application).mount('#my-container')


